stressTests/3.yml
config:
  target: 'https://test.api.nodalblock.com'
  files: 
    - "@./stressTests/test.pdf"
  phases:
    - duration: 100
      arrivalRate: 0
      rampTo: 50
      name: "Stress test incrementing load"
  processor: "./functions.js"
scenarios:
  - flow: 
    - post:
        url: "/v2/es/documents"
        beforeRequest: "setUploadParams"
        afterResponse: "processData"