stressTests/9.yml
config:
  target: 'https://test.api.nodalblock.com'
  payload:
    - path: "./contract.csv"
      fields:
        - "contract_id"
      order: "sequence"
    #- path: "./digitalId.csv"
     # fields:
      #  - "user_tx_hash"
      #order: "sequence"
  phases:
    - duration: 100
      arrivalRate: 0
      rampTo: 50
      name: "Stress test incrementing load"
  processor: "./functions.js"
scenarios:
  - flow: 
    - post:
        url: "/v2/es/id/nodalblock"
        beforeRequest: "setParametersHash"
        afterResponse: "processId"
    - post:
        url: "/v2/es/contracts"
        beforeRequest: "setParametersContract"
        afterResponse: "processContractData"
    - post: 
        url: "/v2/es/contracts/{{ contract_id }}"
        user_hash : "0x21df6fb17b5531e5539d2ea37de9a3dcbb866c46bbfed6916cc87abc667e3171"
        beforeRequest: "setParametersSign"
        afterResponse: "logHeaders"